под_ударением(у).
без_ударения(б).

омофон_пара(а, я).
омофон_пара(б, п).
омофон_пара(в, ф).
омофон_пара(г, к).
омофон_пара(д, т).
омофон_пара(ж, ш).
омофон_пара(з, с).
омофон_пара(ч, щ).
омофон_пара(и, ы).
омофон_пара(е, э).
омофон_пара(у, ю).
омофон_пара(я, а).
омофон_пара(п, б).
омофон_пара(ф, в).
омофон_пара(к, г).
омофон_пара(т, д).
омофон_пара(ш, ж).
омофон_пара(с, з).
омофон_пара(щ, ч).
омофон_пара(ы, и).
омофон_пара(э, е).
омофон_пара(ю, у).
омофон_пара(н, м).
омофон_пара(м, н).
омофон_пара(ц, с).
омофон_пара(с, ц).

гласная(а).
гласная(е).
гласная(и).
гласная(ю).
гласная(у).
гласная(ы).
гласная(о).
гласная(я).
гласная(э).
гласная(ё).

согласная(й).
согласная(ц).
согласная(к).
согласная(н).
согласная(г).
согласная(ш).
согласная(щ).
согласная(з).
согласная(х).
согласная(ъ).
согласная(ф).
согласная(в).
согласная(п).
согласная(р).
согласная(л).
согласная(д).
согласная(ж).
согласная(ч).
согласная(с).
согласная(м).
согласная(т).
согласная(ь).
согласная(б).

существительное(заяц, 1).
существительное(волк, 1).
существительное(ребёнок, 2).
существительное(кот, 1).
существительное(тигр, 1).
существительное(крокодил, 3).
существительное(человек, 3).
существительное(страус, 1).
существительное(ученик, 2).
существительное(студент, 2).
существительное(пингвин, 2).
существительное(день, 1).
существительное(пень, 1).
существительное(лесник, 2).
существительное(пес, 1).
существительное(нос, 1).
существительное(сон, 1).
существительное(небо, 1).
существительное(космос, 1).
существительное(музей, 2).
существительное(кино, 2).
существительное(стол, 1).
существительное(театр, 2).
существительное(новичок, 3).
существительное(дом, 1).
существительное(чувство, 1).
существительное(мир, 1).
существительное(бегемот, 3).
существительное(жук, 1).
существительное(почтальон, 3).
существительное(рабочий, 2).
существительное(птенец, 2).
существительное(город, 1).
существительное(хищник, 1).
существительное(царь, 1).
существительное(принц, 1).
существительное(отец, 2).
существительное(король, 2).
существительное(беглец, 2).
существительное(жираф, 2).
существительное(дым, 1).
существительное(городовой, 4).
существительное(будильник, 2).
существительное(прохожий, 2).
существительное(учитель, 2).
существительное(увалень, 1).
существительное(хромой, 2).
существительное(пляж, 1).
существительное(нож, 1).
существительное(саквояж, 3).
существительное(трактор, 1).
существительное(машинист, 3).
существительное(тракторист, 3).
существительное(поезд, 1).
существительное(курорт, 2).
существительное(вагон, 2).
существительное(хоровод, 3).
существительное(цвет, 1).
существительное(свет, 1).
существительное(максим, 2).
существительное(грузчик, 1).
существительное(водитель, 2).
существительное(андрей, 2).
существительное(алексей, 3).
существительное(вадим, 2).
существительное(козел, 2).
существительное(баран, 2).
существительное(ведро, 2).
существительное(бассейн, 2).
существительное(роман, 2).
существительное(барабан, 3).
существительное(бармен, 1).
существительное(работник, 2).
существительное(цемент, 2).
существительное(элемент, 3).
существительное(мерзавец, 2).
существительное(американец, 4).
существительное(медведь, 2).
существительное(лебедь, 1).
существительное(фокус, 1).
существительное(рот, 1).
существительное(фонтан, 2).
существительное(праведник, 1).
существительное(повар, 1).
существительное(дикарь, 2).
существительное(варвар, 1).
существительное(рыцарь, 1).
существительное(воин, 1).
существительное(вождь, 1).
существительное(математик, 3).
существительное(мороженое, 2).
существительное(пирожное, 2).
существительное(крестьянин, 2).
существительное(вельможа, 2).
существительное(скунс, 1).
существительное(кот, 1).
существительное(снегирь, 2).
существительное(моряк, 2).
существительное(капитан, 3).
существительное(бедняк, 2).
существительное(богач, 2).
существительное(бык, 1).
существительное(слон, 1).
существительное(укротитель, 3).

глагол(сидит, 2).
глагол(ходит, 1).
глагол(бегает, 1).
глагол(кричит, 2).
глагол(качается, 2).
глагол(скачет, 1).
глагол(валяется, 2).
глагол(кушает, 1).
глагол(царствует, 1).
глагол(готовит, 2).
глагол(убирается, 3).
глагол(моется, 1).
глагол(молится, 1).
глагол(лечится, 1).
глагол(кидает, 2).
глагол(прыгает, 1).
глагол(каркает, 1).
глагол(цветет, 2).
глагол(улыбается, 3).
глагол(шелестит, 3).
глагол(убегает, 3).
глагол(кривляется, 2).
глагол(спит, 1).
глагол(кувыркается, 3).
глагол(мямлит, 1).
глагол(гудит, 2).
глагол(стонет, 1).
глагол(орет, 2).
глагол(хохочет, 2).
глагол(танцует, 2).
глагол(молчит, 2).
глагол(уворачивается, 3).
глагол(бродит, 1).
глагол(носит, 1).
глагол(возит, 1).
глагол(косит, 1).
глагол(говорит, 3).
глагол(слушает, 1).
глагол(носится, 1).
глагол(цепляет, 2).
глагол(храпит, 2).
глагол(увольняет, 3).
глагол(вышивает, 3).
глагол(печатает, 2).
глагол(встает, 3).
глагол(тестирует, 2).
глагол(давит, 1).
глагол(держит, 1).
глагол(глотает, 2).
глагол(рожает, 2).
глагол(получает, 3).
глагол(излагает, 3).
глагол(продолжает, 4).
глагол(работает, 2).
глагол(клонится, 1).
глагол(пьет, 1).
глагол(кушает, 1).
глагол(вспоминает, 3).
глагол(витает, 2).
глагол(уважает, 3).
глагол(спорит, 1).
глагол(гребет, 2).
глагол(следит, 2).
глагол(забывает, 3).
глагол(изучает, 3).
глагол(делает, 1).
глагол(бывает, 1).
глагол(нравится, 1).
глагол(целует, 2).
глагол(выглядит, 1).
глагол(колдует, 2).
глагол(гремит, 2).
глагол(торжествует, 3).
глагол(стучит, 2).
глагол(золотит, 3).
глагол(клянется, 2).
глагол(звучит, 2).
глагол(кромсает, 2).
глагол(жует, 2).
глагол(уводит, 2).
глагол(готовит, 2).
глагол(подходит, 2).
глагол(беспокоится, 3).
глагол(шлет ,1).
глагол(режет, 1).
глагол(лежит, 2).
глагол(кусается, 2).
глагол(цепляется, 2).
глагол(благодарит, 4).
глагол(травит, 1).
глагол(колотит, 2).
глагол(знает, 1).
глагол(мечтает, 2).
глагол(обожает, 3).
глагол(едет, 1).
глагол(борется, 1).
глагол(удивляет, 3).
глагол(прячется, 1).
глагол(рекламирует, 3).
глагол(ценит, 1).
глагол(читает, 2).
глагол(касается, 2).

наречие(ложно, 1).
наречие(тошно, 1).
наречие(громко, 1).
наречие(звонко, 1).
наречие(ломко, 1).
наречие(колко, 1).
наречие(зорко, 1).
наречие(быстро, 1).
наречие(дерзко, 1).
наречие(громко, 1).
наречие(жухло, 1).
наречие(тошно, 1).
наречие(горько, 1).
наречие(грустно, 1).
наречие(весело, 1).
наречие(дико, 1).
наречие(куце, 1).
наречие(доступно, 2).
наречие(дешево, 1).
наречие(бойко, 1).
наречие(мокро, 1).
наречие(широко, 3).
наречие(хрипло, 1).
наречие(важно, 1).
наречие(тихо, 1).
наречие(метко, 1).
наречие(убого, 2).
наречие(дорого, 1).
наречие(вычурно, 1).
наречие(ложно, 1).
наречие(сложно, 1).
наречие(необычно, 3).
наречие(удобно, 2).
наречие(ушло, 1).
наречие(хило, 1).
наречие(хорошо, 3).
наречие(низко, 1).
наречие(лебедем, 1).
наречие(морем, 1).

прилагательное(кроткий, 1).
прилагательное(дохлый, 1).
прилагательное(фирменный, 1).
прилагательное(белый, 1).
прилагательное(смелый, 1).
прилагательное(спелый, 1).
прилагательное(бедный, 1).
прилагательное(новый, 1).
прилагательное(богатый, 2).
прилагательное(красный, 1).
прилагательное(длинный, 1).
прилагательное(серый, 1).
прилагательное(высокий, 2).
прилагательное(хромой, 2).
прилагательное(теплый, 1).
прилагательное(хороший, 2).
прилагательное(старый, 1).
прилагательное(гадкий, 1).
прилагательное(тихий, 1).
прилагательное(щуплый, 1).
прилагательное(горький, 1).
прилагательное(мокрый, 1).
прилагательное(веселый, 2).
прилагательное(синий, 1).
прилагательное(черный, 1).
прилагательное(зеленый, 2).
прилагательное(желтый, 1).
прилагательное(грязный, 1).
прилагательное(сильный, 1).
прилагательное(кислый, 1).
прилагательное(липкий, 1).
прилагательное(гибкий, 1).
прилагательное(громкий, 1).
прилагательное(мощный, 1).
прилагательное(волевой, 3).
прилагательное(шоковый, 1).
прилагательное(вешний, 1).
прилагательное(трогательный, 1).
прилагательное(милый, 1).
прилагательное(дивный, 1).
прилагательное(зрелый, 1).
прилагательное(взрослый, 1).
прилагательное(детский, 1).
прилагательное(доступный, 2).
прилагательное(исходящий, 3).
прилагательное(цирковой, 3).
прилагательное(домашний, 2).
прилагательное(фиолетовый, 3).
прилагательное(ультрамариновый, 4).
прилагательное(оранжевый, 2).
прилагательное(дикий, 1).
прилагательное(острый, 1).
прилагательное(зоркий, 1).
прилагательное(черствый, 1).
прилагательное(цепкий, 1).
прилагательное(крепкий, 1).
прилагательное(норковый, 1).
прилагательное(плохой, 1).
прилагательное(средний, 1).
прилагательное(первый, 1).
прилагательное(второй, 1).
прилагательное(третий, 1).
прилагательное(четвертый, 2).
прилагательное(последний, 2).
прилагательное(ледяной, 3).
прилагательное(водяной, 3).
прилагательное(огненный, 1).
прилагательное(комфортный, 2).
прилагательное(опасный, 2).
прилагательное(боковой, 3).
прилагательное(родной, 2).
прилагательное(фирменный, 1).
прилагательное(жаркий, 1).
прилагательное(холодный, 2).
прилагательное(эффективный, 3).
прилагательное(мировой, 3).
прилагательное(коренной, 3).
прилагательное(чужой, 2).
прилагательное(стройный, 1).
прилагательное(медленный, 1).
прилагательное(черепаший, 3).
прилагательное(гармоничный, 3).
прилагательное(хлипкий, 1).
прилагательное(каретный, 2).
прилагательное(цифровой, 3).
прилагательное(живой, 2).
прилагательное(мертвый, 1).
прилагательное(душевный, 2).
прилагательное(лесной, 2).
прилагательное(городской, 3).
прилагательное(деревенский, 3).
прилагательное(животный, 2).
прилагательное(ушлый, 1).
прилагательное(ленивый, 2).
прилагательное(чопорный, 1).
прилагательное(дерзкий, 1).
прилагательное(целевой, 3).
прилагательное(бездарный, 2).
прилагательное(родительский, 2).
прилагательное(слабый, 1).
прилагательное(внезапный, 2).
прилагательное(легкий, 1).
прилагательное(тяжелый, 2).
прилагательное(идейный, 2).
прилагательное(безумный, 2).
прилагательное(сумашедший, 3).
прилагательное(десятый, 2).
прилагательное(боязливый, 4).
прилагательное(золотой, 3).
прилагательное(кудрявый, 2).
прилагательное(карий, 1).
прилагательное(левый, 1).
прилагательное(правый, 1).
прилагательное(остаточный, 2).
прилагательное(здоровый, 2).
прилагательное(дорожный, 2).
прилагательное(киношный, 2).
прилагательное(архивный, 2).
прилагательное(летний, 1).
прилагательное(зимний, 1).
прилагательное(женатый, 2).
прилагательное(холостой, 3).
прилагательное(удобный, 2).
прилагательное(утренний, 1).
прилагательное(ночной, 2).
прилагательное(вежливый, 1).
прилагательное(кольцевой, 3).
прилагательное(книжный, 1).
прилагательное(родной, 2).
прилагательное(стародавний, 3).
прилагательное(увлекательный, 3).
прилагательное(важный, 1).
прилагательное(занудный, 2).
прилагательное(шоколадный, 3).
прилагательное(сладкий, 1).
прилагательное(находчивый, 2).
прилагательное(лучший, 1).
прилагательное(прочный, 1).
прилагательное(ягодный, 1).

длина(Слово, Длина_слова) :- atom_chars(Слово, Буквы) , length(Буквы, Длина_слова).

слово(С) :- (существительное(С, _) ; прилагательное(С, _) ; глагол(С, _) ; наречие(С, _)).

ритм(убубубуб, хорей).
ритм(убубббу, рваный_хорей).
ритм(бубубубуб, ямб).
ритм(бубубубу, ямб1).
ритм(бубубббуб, рваный_ямб).
ритм(бубббубу, рваный_ямб1).

ударение(Слово, Номер_ударной_гласной) :- прилагательное(Слово, Номер_ударной_гласной) ;
                                          глагол(Слово, Номер_ударной_гласной) ;
                                          наречие(Слово, Номер_ударной_гласной) ;
                                          существительное(Слово, Номер_ударной_гласной), !.

шаблон(Предложение, Шаблон) :- подобрать_шаблон(Предложение, Тона),
                               atom_chars(Шаблон, Тона).

подобрать_шаблон([], []).
подобрать_шаблон([Слово|Остальное], Тона) :- ударение(Слово, У),
                                    atom_chars(Слово, Буквы),
                                    построить_шаблон_для_слова(У, Буквы, 1, Часть_шаблона),
                                    append(Часть_шаблона, Окончание_шаблона, Тона),
                                    подобрать_шаблон(Остальное, Окончание_шаблона), !.

построить_шаблон_для_слова(_, [], _, []).
построить_шаблон_для_слова(У, [Буква | Окончание], Ном, Шаблон) :- согласная(Буква),
                                                        построить_шаблон_для_слова(У, Окончание, Ном, Шаблон), !.
построить_шаблон_для_слова(У, [Буква | Окончание], Ном, [Тон | Остальное]) :- гласная(Буква),
                                                                        След #= Ном + 1,
                                                                        У = Ном,
                                                                        Тон = у,
                                                                        построить_шаблон_для_слова(У, Окончание, След, Остальное), !.
построить_шаблон_для_слова(У, [Буква | Окончание], Ном, [Тон | Остальное]) :- гласная(Буква),
                                                                        След #= Ном + 1,
                                                                        Тон = б,
                                                                        построить_шаблон_для_слова(У, Окончание, След, Остальное), !.

индекс_гласной(Слово, Номер_гласной, Индекс_гласной) :- atom_chars(Слово, Буквы), посчитать_индекс_гласной(Буквы, Номер_гласной, 0, 1, Индекс_гласной).

% А = номер гласной, индекс которой надо посчитать
% Б = номер последней встреченной гласной
% В = текущий индекс
% Г = индекс нужной гласной
посчитать_индекс_гласной([], _, _, _, _).
посчитать_индекс_гласной([Буква|Окончание], А, Б, В, Г) :- согласная(Буква),
                                                            Д #= В + 1,
                                                            посчитать_индекс_гласной(Окончание, А, Б, Д, Г),
                                                            !.
посчитать_индекс_гласной([Буква|Окончание], А, Б, В, Г) :- гласная(Буква),
                                                            В1 #= В + 1,
                                                            Б1 #= Б + 1,
                                                            Б1 #< А,
                                                            посчитать_индекс_гласной(Окончание, А, Б1, В1, Г),
                                                            !.
посчитать_индекс_гласной([Буква|Окончание], А, Б, В, Г) :- гласная(Буква),
                                                            В1 #= В + 1,
                                                            Б1 #= Б + 1,
                                                            Б1 #= А,
                                                            Г #= В,
                                                            посчитать_индекс_гласной(Окончание, А, Б1, В1, Г),
                                                            !.
посчитать_индекс_гласной([Буква|Окончание], А, Б, В, Г) :- гласная(Буква),
                                                            В1 #= В + 1,
                                                            Б1 #= Б + 1,
                                                            Б1 #> А,
                                                            посчитать_индекс_гласной(Окончание, А, Б1, В1, Г),
                                                            !.

ударение_на_тот_же_слог(С1, С2) :- ударение(С1, У1),
                                   ударение(С2, У2),
                                   индекс_гласной(С1, У1, И1),
                                   индекс_гласной(С2, У2, И2),
                                   длина(С1, Д1),
                                   длина(С2, Д2),
                                   Д1 - И1 #= Д2 - И2.


ритм_предложения(П, Ритм) :- шаблон(П, Ш), ритм(Ш, Ритм).

похожие_по_звучанию([], []).
похожие_по_звучанию([Б1|К1], [Б2|К2]) :- Б1 = Б2, похожие_по_звучанию(К1, К2).
похожие_по_звучанию([Б1|К1], [Б2|К2]) :- омофон_пара(Б1, Б2), похожие_по_звучанию(К1, К2).

рифмуется(С1, С2) :-
                    ударение(С1, У1),
                    ударение(С2, У2),
                    индекс_гласной(С1, У1, И1),
                    индекс_гласной(С2, У2, И2),
                    atom_chars(С1, Буквы1),
                    atom_chars(С2, Буквы2),
                    length(Буквы1, Д1),
                    length(Буквы2, Д2),
                    Д1 - И1 #= Д2 - И2, % ударение на тот же слог
                    slice(Буквы1, И1, Д1, Окончание1),
                    slice(Буквы2, И2, Д2, Окончание2),
                    похожие_по_звучанию(Окончание1, Окончание2),
                    С1 \= С2.


стих([П1, Щ1, Н1, Г1], [Н2, Г2, Щ2], [П3, Щ3, Н3, Г3], [Н4, Г4, Щ4], Р1, Р2, Р3, Р4) :-
    прилагательное(П1, _),
    существительное(Щ1, _),
    наречие(Н1, _),
    глагол(Г1, _),
    ритм_предложения([П1, Щ1, Н1, Г1], Р1),
    наречие(Н2, _),
    Н1 \= Н2,
    глагол(Г2, _),
    Г1 \= Г2,
    существительное(Щ2, _),
    Щ1 \= Щ2,
    ритм_предложения([Н2, Г2, Щ2], Р2),
    прилагательное(П3, _),
    П1 \= П3,
    существительное(Щ3, _),
    Щ1 \= Щ3,
    Щ2 \= Щ3,
    наречие(Н3, _),
    Н2 \= Н3,
    Н1 \= Н3,
    глагол(Г3, _),
    Г2 \= Г3,
    Г1 \= Г3,
    ритм_предложения([П3, Щ3, Н3, Г3], Р3),
    рифмуется(Г1, Г3),
    наречие(Н4, _),
    Н1 \= Н4,
    Н3 \= Н4,
    Н2 \= Н4,
    глагол(Г4, _),
    Г1 \= Г4,
    Г3 \= Г4,
    Г2 \= Г4,
    существительное(Щ4, _),
    Щ1 \= Щ4,
    Щ3 \= Щ4,
    Щ2 \= Щ4,
    ритм_предложения([Н4, Г4, Щ4], Р4),
    рифмуется(Щ2, Щ4).

классика(Стих) :- стих(А, Б, В, Г, хорей, рваный_хорей, хорей, рваный_хорей), Стих = [А, Б, В, Г].
